# #年間平均貯金額が（年齢）^2*0.06の場合、
## 年間平均貯蓄額の算出方法は、22歳の年間平均貯金額と32歳の年間平均貯蓄額を y=ax^2を元に算出
# x = 65
# #x:年齢
# z = x - 22
# #z:22歳新卒の際の合計勤務年数
# ya = []
# sa = []

# for i in range(z):
#   if i == 0:
#     print("新卒")

#   print(str(i)+"年目")
#   #i:勤務年数
#   y = 0.06 * ((i+22)**2)
#   print("今年の貯金額:"+str(y))
#   ya.append(y)
#   ys = sum(ya)
#   #ys:年間貯蓄金額の合計である。
#   print("合計貯蓄金額:"+str(ys))

#   s = (24+y)*1.03
#   sa.append(s)
#   ss = sum(sa)
#   #ss:指定期間内に年利3%で運用した際の合計金額
#   print("期間内合計運用資産:"+str(ss))

#---------------------------------------------------



#年間平均貯金額が（年齢）^2*0.08の場合、
x = 65
#x:年齢
z = x - 22
#z:22歳新卒の際の合計勤務年数
ya = []
sa = []

for i in range(z):
  if i == 0:
    print("新卒")

  print(str(i)+"年目")
  #i:勤務年数
  y = 0.08 * ((i+22)**2)
  print("今年の貯金額:"+str(y))
  ya.append(y)
  ys = sum(ya)
  #ys:年間貯蓄金額の合計である。
  print("合計貯蓄金額:"+str(ys))

  s = (24+y)*1.03
  sa.append(s)
  ss = sum(sa)
  #ss:指定期間内に年利3%で運用した際の合計金額
  print("期間内合計運用資産:"+str(ss))